nxproxy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-12 Sat 15:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>using nxproxy</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">using nxproxy</h1>
<p>
nxproxy is the community maintained old foss version of NoMachine's
now proprietary NX protocol. it's like X11 forwarding but a hell of a
lot faster. sadly, the community maintained version is based around
X11 old enough that it does not support a lot of modern features like
graphics acceleration, so this is more for stuff like graphical text
editors. if you want remote gaming, you probably want to use something
else.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. simple setup</a>
<ul>
<li><a href="#org0000001">1.1. choosing a display number</a></li>
<li><a href="#org0000002">1.2. client setup</a>
<ul>
<li><a href="#org0000003">1.2.1. X11 access control</a></li>
<li><a href="#org0000004">1.2.2. starting nxproxy</a></li>
</ul>
</li>
<li><a href="#org0000005">1.3. server setup</a>
<ul>
<li><a href="#org0000006">1.3.1. starting nxproxy</a></li>
<li><a href="#org0000007">1.3.2. set the <code>DISPLAY</code> and start your application</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0000008">2. x2go</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> simple setup</h2>
<div class="outline-text-2" id="text-1">
<p>
you probably want to tunnel this over ssh or <a href="./wireguard.html">wireguard</a> etc, as the NX
protocol is plaintext. the port will be 4000 plus the display number.
</p>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.1.</span> choosing a display number</h3>
<div class="outline-text-3" id="text-1-1">
<p>
just pick one that is not in use, if your server is running its own
X11 server, then <code>0</code> is probably already taken. depending on the
server configuration, you may be able to use the <code>who</code> command on it
to see which ones are in use.
</p>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.2.</span> client setup</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org0000003" class="outline-4">
<h4 id="org0000003"><span class="section-number-4">1.2.1.</span> X11 access control</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
give the server access to connect to your client's X11 server. the
correct way to do with would be with <code>.Xauthority</code> and such, however
we can just use <code>xhost</code> for this.
</p>

<pre class="example" id="org0000009">
xhost +
</pre>

<p>
will allow any host to connect to our X11 server (this is a bad idea
on a shared system, since anyone with access to your unix socket will
be able to mess with your X11 server)
</p>
</div>
</div>

<div id="outline-container-org0000004" class="outline-4">
<h4 id="org0000004"><span class="section-number-4">1.2.2.</span> starting nxproxy</h4>
<div class="outline-text-4" id="text-1-2-2">
<pre class="example" id="org0000009">
nxproxy -S feesh:7
</pre>

<p>
replacing <code>feesh</code> with your server's hostname, and <code>7</code> with your
chosen display number
</p>

<p>
use <code>localhost</code> as the hostname if you are doing this over an ssh
tunnel
</p>
</div>
</div>
</div>

<div id="outline-container-org0000005" class="outline-3">
<h3 id="org0000005"><span class="section-number-3">1.3.</span> server setup</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org0000006" class="outline-4">
<h4 id="org0000006"><span class="section-number-4">1.3.1.</span> starting nxproxy</h4>
<div class="outline-text-4" id="text-1-3-1">
<pre class="example" id="org0000009">
nxproxy -C :7
</pre>

<p>
replacing <code>7</code> with your chosen display number
</p>

<p>
you can start this in the background with a <code>&amp;</code> at the end, if you do
not have a terminal multiplexer handy and want to run more stuff from
the current terminal
</p>
</div>
</div>

<div id="outline-container-org0000007" class="outline-4">
<h4 id="org0000007"><span class="section-number-4">1.3.2.</span> set the <code>DISPLAY</code> and start your application</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
for example if your display number was <code>7</code> and you wanted to connect a
graphical session to your emacs daemon
</p>

<pre class="example" id="org0000009">
export DISPLAY=:7
emacsclient -c
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0000008" class="outline-2">
<h2 id="org0000008"><span class="section-number-2">2.</span> x2go</h2>
<div class="outline-text-2" id="text-2">
<p>
x2go is probably a better setup, however i am unable to get it
working. it just crashes with nothing useful in it's or X11's logs
after connecting
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-10-02 Sun]</span></span>: be careful if you want a functional system! at the
time of writing, x2go seems to imperatively change some system stuff
when run, with no way to change it back
</p>
</div>
</div>
</div>
</body>
</html>
